duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
void EnterSettingsScreen(void);
void EnterSyncDataScreen(void);
void EnterTempScreen(void);
void EnterSPO2Screen(void);
void EnterBPScreen(void);
void EnterSleepScreen(void);
void EnterStepsScreen(void);

void ShowBootUpLogoFinished(void)
{
	EnterIdleScreen();
}

void ShowBootUpLogo(void)
{
	uint8_t i,count=0;
	uint16_t x,y,w,h;

#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaShow(PWRON_LOGO_X, PWRON_LOGO_Y, logo_img, ARRAY_SIZE(logo_img), 200, false, ShowBootUpLogoFinished);
#else
  #ifdef IMG_FONT_FROM_FLASH
	LCD_ShowImg_From_Flash(PWRON_LOGO_X, PWRON_LOGO_Y, IMG_PWRON_ANI_6_ADDR);
  #else
	LCD_ShowImg(PWRON_LOGO_X, PWRON_LOGO_Y, IMG_PWRON_ANI_6_ADDR);
  #endif
  
	k_sleep(K_MSEC(1000));
	ShowBootUpLogoFinished();
#endif
}

void MainMenuTimerOutCallBack(struct k_timer *timer_id)
{
	if(screen_id == SCREEN_ID_GPS_TEST)
	{
		MenuStartGPS();
	}
	else if(screen_id == SCREEN_ID_NB_TEST)
	{
		MenuStartNB();
	}
	else if(screen_id == SCREEN_ID_BLE_TEST)
	{
		
	}
#ifdef CONFIG_WIFI_SUPPORT	
	else if(screen_id == SCREEN_ID_WIFI_TEST)
	{
		MenuStartWifi();
	}
#endif	
#ifdef CONFIG_FOTA_DOWNLOAD	
	else if(screen_id == SCREEN_ID_FOTA)
	{
		MenuStartFOTA();
	}
#endif
#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
	else if(screen_id == SCREEN_ID_DL)
	{
		switch(g_dl_data_type)
		{
		case DL_DATA_IMG:
			switch(get_dl_status())
			{
			case DL_STATUS_PREPARE:
				dl_start();
				break;
				
			case DL_STATUS_FINISHED:
			case DL_STATUS_ERROR:
				if((strcmp(g_new_font_ver,g_font_ver) != 0) && (strlen(g_new_font_ver) > 0))
					dl_font_start();
			#if defined(CONFIG_PPG_SUPPORT)
				else if((strcmp(g_new_ppg_ver,g_ppg_algo_ver) != 0) && (strlen(g_new_ppg_ver) > 0))
					dl_ppg_start();
			#endif
				else
				{
					if(get_dl_status() == DL_STATUS_FINISHED)
						dl_reboot_confirm();
					else
						EntryIdleScr();
				}
				break;
			}
			break;

		case DL_DATA_FONT:
			switch(get_dl_status())
			{
			case DL_STATUS_PREPARE:
				dl_start();
				break;

			case DL_STATUS_FINISHED:
			case DL_STATUS_ERROR:
			#if defined(CONFIG_PPG_SUPPORT)
				if((strcmp(g_new_ppg_ver,g_ppg_algo_ver) != 0) && (strlen(g_new_ppg_ver) > 0))
					dl_ppg_start();
				else
			#endif		
				{
					if(get_dl_status() == DL_STATUS_FINISHED)
						dl_reboot_confirm();
					else
						EntryIdleScr();
				}
				break;
			}
			break;
			
		case DL_DATA_PPG:
			switch(get_dl_status())
			{
			case DL_STATUS_PREPARE:
				dl_start();
				break;

			case DL_STATUS_FINISHED:
			case DL_STATUS_ERROR:
				if(get_dl_status() == DL_STATUS_FINISHED)
					dl_reboot_confirm();
				else
					EntryIdleScr();
				break;
			}
			break;
		}
	}
#endif
#ifdef CONFIG_SYNC_SUPPORT
	else if(screen_id == SCREEN_ID_SYNC)
	{
		MenuStartSync();
	}
#endif
#ifdef CONFIG_TEMP_SUPPORT
	else if(screen_id == SCREEN_ID_TEMP)
	{
		if(get_temp_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartTemp();
		}
	}
#endif
	else if(screen_id == SCREEN_ID_SETTINGS)
	{
		ExitSettingsScreen();
	}
	else if(screen_id == SCREEN_ID_POWEROFF)
	{
		EntryIdleScr();
	}
#ifdef UI_STYLE_HEALTH_BAR
	else if(screen_id == SCREEN_ID_HR)
	{
	#ifdef CONFIG_PPG_SUPPORT
		if(get_hr_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartHr();
		}
	#endif
	}
	else if(screen_id == SCREEN_ID_SPO2)
	{
	#ifdef CONFIG_PPG_SUPPORT
		if(get_spo2_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartSpo2();
		}
	#endif
	}
	else if(screen_id == SCREEN_ID_BP)
	{
	#ifdef CONFIG_PPG_SUPPORT
		if(get_bpt_ok_flag)
		{
			EntryIdleScr();
		}
		else
		{
			MenuStartBpt();
		}
	#endif
	}
#endif/*UI_STYLE_HEALTH_BAR*/
}

#ifdef CONFIG_BLE_SUPPORT
void IdleShowBleStatus(void)
{
	uint16_t x,y,w,h;
	uint16_t ble_link_str[] = {0x0042,0x004C,0x0045,0x0000};//BLE

	LCD_SetFontSize(FONT_SIZE_28);

	if(g_ble_connected)
	{
		LCD_MeasureUniString(ble_link_str, &w, &h);
		LCD_ShowUniString(IDLE_BLE_X+(IDLE_BLE_W-w)/2, IDLE_BLE_Y+(IDLE_BLE_H-w)/2, ble_link_str);
	}
	else
	{
		LCD_FillColor(IDLE_BLE_X, IDLE_BLE_Y, IDLE_BLE_W, IDLE_BLE_H, BLACK);
	}
}
#endif

void IdleShowSystemDate(void)
{
	uint16_t x,y,w,h;
	uint8_t str_date[20] = {0};
	uint8_t tmpbuf[128] = {0};
#ifdef FONTMAKER_UNICODE_FONT	
	uint16_t str_mon[LANGUAGE_MAX][12][7] = {
											#ifndef FW_FOR_CN
												{//English
													{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
													{0x0046,0x0065,0x0062,0x0000,0x0000},//Feb
													{0x004D,0x0061,0x0072,0x0000,0x0000},//Mar
													{0x0041,0x0070,0x0072,0x0000,0x0000},//Apr
													{0x004D,0x0061,0x0079,0x0000,0x0000},//May
													{0x004A,0x0075,0x006E,0x0000,0x0000},//Jun
													{0x004A,0x0075,0x006C,0x0000,0x0000},//Jul
													{0x0041,0x0075,0x0067,0x0000,0x0000},//Aug
													{0x0053,0x0065,0x0070,0x0074,0x0000},//Sept
													{0x004F,0x0063,0x0074,0x0000,0x0000},//Oct
													{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
													{0x0044,0x0065,0x0063,0x0000,0x0000},//Dec
												},
												{//Deutsch
													{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
													{0x0046,0x0065,0x0062,0x0000,0x0000},//Feb
													{0x004D,0x00E4,0x0072,0x007A,0x0000},//M鋜z
													{0x0041,0x0070,0x0072,0x0000,0x0000},//Apr
													{0x004D,0x0061,0x0069,0x0000,0x0000},//Mai
													{0x004A,0x0075,0x006E,0x0000,0x0000},//Jun
													{0x004A,0x0075,0x006C,0x0000,0x0000},//Jul
													{0x0041,0x0075,0x0067,0x0000,0x0000},//Aug
													{0x0053,0x0065,0x0070,0x0074,0x0000},//Sept
													{0x004F,0x006B,0x0074,0x0000,0x0000},//Okt
													{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
													{0x0044,0x0065,0x007A,0x0000,0x0000},//Dez
												},
												{//French
													{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
													{0x0046,0x00E9,0x0076,0x0000,0x0000},//Fév
													{0x004D,0x0061,0x0072,0x0000,0x0000},//Mar
													{0x0041,0x0076,0x0072,0x0000,0x0000},//Avr
													{0x004D,0x0061,0x0069,0x0000,0x0000},//Mai
													{0x004A,0x0075,0x0069,0x006E,0x0000},//Juin
													{0x004A,0x0075,0x0069,0x006C,0x0000},//Juil
													{0x0041,0x006F,0x00FB,0x0074,0x0000},//Ao?t
													{0x0053,0x0065,0x0070,0x0074,0x0000},//Sept
													{0x004F,0x0063,0x0074,0x0000,0x0000},//Oct
													{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
													{0x0044,0x00E9,0x0063,0x0000,0x0000},//Déc
												},
												{//Italian
													{0x0047,0x0065,0x006E,0x0000},//Gen
													{0x0046,0x0065,0x0062,0x0000},//Feb
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x0041,0x0070,0x0072,0x0000},//Apr
													{0x004D,0x0061,0x0067,0x0000},//Mag
													{0x0047,0x0069,0x0075,0x0000},//Giu
													{0x004C,0x0075,0x0067,0x0000},//Lug
													{0x0041,0x0067,0x006F,0x0000},//Ago
													{0x0053,0x0065,0x0074,0x0000},//Set
													{0x004F,0x0074,0x0074,0x0000},//Ott
													{0x004E,0x006F,0x0076,0x0000},//Nov
													{0x0044,0x0069,0x0063,0x0000},//Dic
												},
												{//Spanish
													{0x0045,0x006E,0x0065,0x0000},//Ene
													{0x0046,0x0065,0x0062,0x0000},//Feb
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x0041,0x0062,0x0072,0x0000},//Abr
													{0x004D,0x0061,0x0079,0x0000},//May
													{0x004A,0x0075,0x006E,0x0000},//Jun
													{0x004A,0x0075,0x006C,0x0000},//Jul
													{0x0041,0x0067,0x006F,0x0000},//Ago
													{0x0053,0x0065,0x0070,0x0000},//Sep
													{0x004F,0x0063,0x0074,0x0000},//Oct
													{0x004E,0x006F,0x0076,0x0000},//Nov
													{0x0044,0x0069,0x0063,0x0000},//Dic
												},
												{//Portuguese
													{0x004A,0x0061,0x006E,0x0000},//Jan
													{0x0046,0x0065,0x0076,0x0000},//Fev
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x0041,0x0062,0x0072,0x0000},//Abr
													{0x004D,0x0061,0x0069,0x0000},//Mai
													{0x004A,0x0075,0x006E,0x0000},//Jun
													{0x004A,0x0075,0x006C,0x0000},//Jul
													{0x0041,0x0067,0x006F,0x0000},//Ago
													{0x0053,0x0065,0x0074,0x0000},//Set
													{0x004F,0x0063,0x0074,0x0000},//Oct
													{0x004E,0x006F,0x0076,0x0000},//Nov
													{0x0044,0x0065,0x007A,0x0000},//Dez
												},
												{//Polish
													{0x0053,0x0074,0x0079,0x002E,0x0000},//Sty.
													{0x004C,0x0075,0x0074,0x0079,0x0000},//Luty
													{0x004D,0x0061,0x0072,0x007A,0x002E,0x0000},//Marz.
													{0x004B,0x0077,0x0069,0x0065,0x002E,0x0000},//Kwie.
													{0x004D,0x0061,0x006A,0x0000},//Maj
													{0x0043,0x007A,0x0065,0x0072,0x002E,0x0000},//Czer.
													{0x004C,0x0069,0x0070,0x002E,0x0000},//Lip.
													{0x0053,0x0069,0x0065,0x0072,0x002E,0x0000},//Sier.
													{0x0057,0x0072,0x007A,0x002E,0x0000},//Wrz.
													{0x0050,0x0061,0x017A,0x002E,0x0000},//Pa?.
													{0x004C,0x0069,0x0073,0x0074,0x002E,0x0000},//List.
													{0x0047,0x0072,0x0075,0x002E,0x0000},//Gru.
												},
												{//Swedish
													{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
													{0x0046,0x0065,0x0062,0x0000,0x0000},//Feb
													{0x004D,0x0061,0x0072,0x0000,0x0000},//Mar
													{0x0041,0x0070,0x0072,0x0000,0x0000},//Apr
													{0x004D,0x0061,0x0079,0x0000,0x0000},//May
													{0x004A,0x0075,0x006E,0x0000,0x0000},//Jun
													{0x004A,0x0075,0x006C,0x0000,0x0000},//Jul
													{0x0041,0x0075,0x0067,0x0000,0x0000},//Aug
													{0x0053,0x0065,0x0070,0x0000,0x0000},//Sep
													{0x004F,0x0063,0x0074,0x0000,0x0000},//Oct
													{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
													{0x0044,0x0065,0x0063,0x0000,0x0000},//Dec
												},
												{//Japanese
													{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
													{0x0046,0x0065,0x0062,0x0000,0x0000},//Feb
													{0x004D,0x0061,0x0072,0x0000,0x0000},//Mar
													{0x0041,0x0070,0x0072,0x0000,0x0000},//Apr
													{0x004D,0x0061,0x0079,0x0000,0x0000},//May
													{0x004A,0x0075,0x006E,0x0000,0x0000},//Jun
													{0x004A,0x0075,0x006C,0x0000,0x0000},//Jul
													{0x0041,0x0075,0x0067,0x0000,0x0000},//Aug
													{0x0053,0x0065,0x0070,0x0074,0x0000},//Sept
													{0x004F,0x0063,0x0074,0x0000,0x0000},//Oct
													{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
													{0x0044,0x0065,0x0063,0x0000,0x0000},//Dec
												},
												{//Korea
													{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
													{0x0046,0x0065,0x0062,0x0000,0x0000},//Feb
													{0x004D,0x0061,0x0072,0x0000,0x0000},//Mar
													{0x0041,0x0070,0x0072,0x0000,0x0000},//Apr
													{0x004D,0x0061,0x0079,0x0000,0x0000},//May
													{0x004A,0x0075,0x006E,0x0000,0x0000},//Jun
													{0x004A,0x0075,0x006C,0x0000,0x0000},//Jul
													{0x0041,0x0075,0x0067,0x0000,0x0000},//Aug
													{0x0053,0x0065,0x0070,0x0074,0x0000},//Sept
													{0x004F,0x0063,0x0074,0x0000,0x0000},//Oct
													{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
													{0x0044,0x0065,0x0063,0x0000,0x0000},//Dec
												},
												{//Russian
													{0x042F,0x043D,0x0432,0x0000},//Янв
													{0x0424,0x0435,0x0432,0x0000},//Фев
													{0x041C,0x0430,0x0440,0x0000},//Мар
													{0x0410,0x043F,0x0440,0x0000},//Апр
													{0x041C,0x0430,0x0439,0x0000},//Май
													{0x0418,0x044E,0x043D,0x0000},//Июн
													{0x0418,0x044E,0x043B,0x0000},//Июл
													{0x0410,0x0432,0x0433,0x0000},//Авг
													{0x0421,0x0435,0x043D,0x0000},//Сен
													{0x041E,0x043A,0x0442,0x0000},//Окт
													{0x041D,0x043E,0x044F,0x0000},//Ноя
													{0x0414,0x0435,0x043A,0x0000},//Дек
												},
												{//Greece
													{0x0399,0x03B1,0x03BD,0x002E,0x0000},//Ιαν.
													{0x03A6,0x03B5,0x03B2,0x002E,0x0000},//Φεβ.
													{0x039C,0x03B1,0x03C1,0x002E,0x0000},//Μαρ.
													{0x0391,0x03C0,0x03C1,0x002E,0x0000},//Απρ.
													{0x039C,0x03B1,0x03B9,0x002E,0x0000},//Μαι.
													{0x0399,0x03BF,0x03C5,0x03BD,0x002E,0x0000},//Ιουν.
													{0x0399,0x03BF,0x03C5,0x03BB,0x002E,0x0000},//Ιουλ.
													{0x0391,0x03C5,0x03B3,0x002E,0x0000},//Αυγ.
													{0x03A3,0x03B5,0x03C0,0x03C4,0x002E,0x0000},//Σεπτ.
													{0x039F,0x03BA,0x03C4,0x002E,0x0000},//Οκτ.
													{0x039D,0x03BF,0x03B5,0x002E,0x0000},//Νοε.
													{0x0394,0x03B5,0x03BA,0x002E,0x0000},//Δεκ.
												},
											#else
												{
													{0x4E00,0x6708,0x0000,0x0000,0x0000},//一月
													{0x4E8C,0x6708,0x0000,0x0000,0x0000},//二月
													{0x4E09,0x6708,0x0000,0x0000,0x0000},//三月
													{0x56DB,0x6708,0x0000,0x0000,0x0000},//四月
													{0x4E94,0x6708,0x0000,0x0000,0x0000},//五月
													{0x516D,0x6708,0x0000,0x0000,0x0000},//六月
													{0x4E03,0x6708,0x0000,0x0000,0x0000},//七月
													{0x516B,0x6708,0x0000,0x0000,0x0000},//八月
													{0x4E5D,0x6708,0x0000,0x0000,0x0000},//九月
													{0x5341,0x6708,0x0000,0x0000,0x0000},//十月
													{0x5341,0x4E00,0x6708,0x0000,0x0000},//十一月
													{0x5341,0x4E8C,0x6708,0x0000,0x0000},//十二月
												},
												{
													{0x004A,0x0061,0x006E,0x0000,0x0000},//Jan
													{0x0046,0x0065,0x0062,0x0000,0x0000},//Feb
													{0x004D,0x0061,0x0072,0x0000,0x0000},//Mar
													{0x0041,0x0070,0x0072,0x0000,0x0000},//Apr
													{0x004D,0x0061,0x0079,0x0000,0x0000},//May
													{0x004A,0x0075,0x006E,0x0000,0x0000},//Jun
													{0x004A,0x0075,0x006C,0x0000,0x0000},//Jul
													{0x0041,0x0075,0x0067,0x0000,0x0000},//Aug
													{0x0053,0x0065,0x0070,0x0074,0x0000},//Sept
													{0x004F,0x0063,0x0074,0x0000,0x0000},//Oct
													{0x004E,0x006F,0x0076,0x0000,0x0000},//Nov
													{0x0044,0x0065,0x0063,0x0000,0x0000},//Dec
												},
											#endif
											};
	uint16_t str_mon_cn[2] = {0x6708,0x0000};
	uint16_t str_day_cn[2] = {0x65E5,0x0000};
	uint16_t str_mon_kr[2] = {0xC6D4,0x0000};//?
	uint16_t str_day_kr[2] = {0xC77C,0x0000};//?
	uint16_t *str_m,*str_d;
#else	
	uint8_t *str_mon[12] = {"Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sept","Oct","Nov","Dec"};
#endif
	uint32_t img_24_num[10] = {IMG_FONT_24_NUM_0_ADDR,IMG_FONT_24_NUM_1_ADDR,IMG_FONT_24_NUM_2_ADDR,IMG_FONT_24_NUM_3_ADDR,IMG_FONT_24_NUM_4_ADDR,
							 IMG_FONT_24_NUM_5_ADDR,IMG_FONT_24_NUM_6_ADDR,IMG_FONT_24_NUM_7_ADDR,IMG_FONT_24_NUM_8_ADDR,IMG_FONT_24_NUM_9_ADDR};
	uint32_t img_20_num[10] = {IMG_FONT_20_NUM_0_ADDR,IMG_FONT_20_NUM_1_ADDR,IMG_FONT_20_NUM_2_ADDR,IMG_FONT_20_NUM_3_ADDR,IMG_FONT_20_NUM_4_ADDR,
							 IMG_FONT_20_NUM_5_ADDR,IMG_FONT_20_NUM_6_ADDR,IMG_FONT_20_NUM_7_ADDR,IMG_FONT_20_NUM_8_ADDR,IMG_FONT_20_NUM_9_ADDR};

	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);

	switch(global_settings.language)
	{
  #ifdef FW_FOR_CN
	case LANGUAGE_CHN:
  #else	
	case LANGUAGE_JP:
	case LANGUAGE_KR:
  #endif		
		switch(global_settings.language)
		{
	  #ifdef FW_FOR_CN
		case LANGUAGE_CHN:
			x = IDLE_DATE_MON_CN_X;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_cn;
			str_d = str_day_cn;
			break;
	  #else
	 	case LANGUAGE_JP:
			x = IDLE_DATE_MON_CN_X;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_cn;
			str_d = str_day_cn;
			break;
 	  
		case LANGUAGE_KR:
			x = IDLE_DATE_MON_CN_X-10;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W+10;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_kr;
			str_d = str_day_kr;
			break;
	  #endif
		}
		
