duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
		LCD_FillColor(x, y, w, h, BLACK);
		if(date_time.month > 9)
		{
			LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.month/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.month%10]);

		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_m);
		LCD_MeasureUniString(str_m, &w, &h);
		
		x += w;
		if(date_time.day > 9)
		{
			LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.day/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.day%10]);
		
		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_d);
		break;
	
	default:
		LCD_FillColor(IDLE_DATE_DAY_EN_X, IDLE_DATE_DAY_EN_Y, IDLE_DATE_DAY_EN_W, IDLE_DATE_DAY_EN_H, BLACK);

		LCD_ShowImg_From_Flash(IDLE_DATE_DAY_EN_X+0*IDLE_DATE_NUM_EN_W, IDLE_DATE_DAY_EN_Y+4, img_20_num[date_time.day/10]);
		LCD_ShowImg_From_Flash(IDLE_DATE_DAY_EN_X+1*IDLE_DATE_NUM_EN_W, IDLE_DATE_DAY_EN_Y+4, img_20_num[date_time.day%10]);
	
		LCD_FillColor(IDLE_DATE_MON_EN_X, IDLE_DATE_MON_EN_Y, IDLE_DATE_MON_EN_W, IDLE_DATE_MON_EN_H, BLACK);
		LCD_ShowUniString(IDLE_DATE_MON_EN_X, IDLE_DATE_MON_EN_Y, str_mon[global_settings.language][date_time.month-1]);
		break;
	}
#else
	LCD_SetFontSize(FONT_SIZE_32);

	sprintf((char*)str_date, "%02d", date_time.day);
	LCD_ShowString(IDLE_DATE_DAY_X,IDLE_DATE_DAY_Y,str_date);
	strcpy((char*)str_date, str_mon[date_time.month-1]);
	LCD_ShowString(IDLE_DATE_MON_X,IDLE_DATE_MON_Y,str_date);
#endif
}

void IdleShowSystemTime(void)
{
	static bool flag = false;
	uint32_t img_num[10] = {IMG_FONT_60_NUM_0_ADDR,IMG_FONT_60_NUM_1_ADDR,IMG_FONT_60_NUM_2_ADDR,IMG_FONT_60_NUM_3_ADDR,IMG_FONT_60_NUM_4_ADDR,
							IMG_FONT_60_NUM_5_ADDR,IMG_FONT_60_NUM_6_ADDR,IMG_FONT_60_NUM_7_ADDR,IMG_FONT_60_NUM_8_ADDR,IMG_FONT_60_NUM_9_ADDR};

	flag = !flag;

	LCD_ShowImg_From_Flash(IDLE_TIME_X+0*IDLE_TIME_NUM_W, IDLE_TIME_Y, img_num[date_time.hour/10]);
	LCD_ShowImg_From_Flash(IDLE_TIME_X+1*IDLE_TIME_NUM_W, IDLE_TIME_Y, img_num[date_time.hour%10]);
	
	if(flag)
		LCD_ShowImg_From_Flash(IDLE_TIME_X+2*IDLE_TIME_NUM_W, IDLE_TIME_Y, IMG_FONT_60_COLON_ADDR);
	else
		LCD_Fill(IDLE_TIME_X+2*IDLE_TIME_NUM_W, IDLE_TIME_Y, IDLE_TIME_COLON_W, IDLE_TIME_COLON_H, BLACK);
	
	LCD_ShowImg_From_Flash(IDLE_TIME_X+2*IDLE_TIME_NUM_W+IDLE_TIME_COLON_W, IDLE_TIME_Y, img_num[date_time.minute/10]);
	LCD_ShowImg_From_Flash(IDLE_TIME_X+3*IDLE_TIME_NUM_W+IDLE_TIME_COLON_W, IDLE_TIME_Y, img_num[date_time.minute%10]);
}

void IdleShowSystemWeek(void)
{
	uint16_t x,y,w,h;
#ifdef FONTMAKER_UNICODE_FONT	
	uint16_t str_week[LANGUAGE_MAX][7][6] = {
											#ifndef FW_FOR_CN
												{//English
													{0x0053,0x0075,0x006E,0x0000},//Sun
													{0x004D,0x006F,0x006E,0x0000},//Mon
													{0x0054,0x0075,0x0065,0x0000},//Tue
													{0x0057,0x0065,0x0064,0x0000},//Wed
													{0x0054,0x0068,0x0075,0x0000},//Thu
													{0x0046,0x0072,0x0069,0x0000},//Fri
													{0x0053,0x0061,0x0074,0x0000},//Sat
												},
												{//Deutsch
													{0x0053,0x006F,0x006E,0x0000},//Son
													{0x004D,0x006F,0x006E,0x0000},//Mon
													{0x0044,0x0069,0x0065,0x0000},//Die
													{0x004D,0x0069,0x0074,0x0000},//Mit
													{0x0044,0x006F,0x006E,0x0000},//Don
													{0x0046,0x0072,0x0065,0x0000},//Fre
													{0x0053,0x0061,0x006D,0x0000},//Sam
												},
												{//French
													{0x0044,0x0069,0x006D,0x0000},//Dim
													{0x004C,0x0075,0x006E,0x0000},//Lun
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x004D,0x0065,0x0072,0x0000},//Mer
													{0x004A,0x0065,0x0075,0x0000},//Jeu
													{0x0056,0x0065,0x006E,0x0000},//Ven
													{0x0053,0x0061,0x006D,0x0000},//Sam
												},
												{//Italian
													{0x0044,0x006F,0x006D,0x0000},//Dom
													{0x004C,0x0075,0x006E,0x0000},//Lun
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x004D,0x0065,0x0072,0x0000},//Mer
													{0x0047,0x0069,0x006F,0x0000},//Gio
													{0x0056,0x0065,0x006E,0x0000},//Ven
													{0x0053,0x0061,0x0062,0x0000},//Sab
												},
												{//Spanish
													{0x0044,0x006F,0x006D,0x0000},//Dom
													{0x004C,0x0075,0x006E,0x0000},//Lun
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x004D,0x0069,0x00E9,0x0000},//Mié
													{0x004A,0x0075,0x0065,0x0000},//Jue
													{0x0056,0x0069,0x0065,0x0000},//Vie
													{0x0053,0x00E1,0x0062,0x0000},//Sáb
												},
												{//Portuguese
													{0x0044,0x006F,0x006D,0x0000},//Dom
													{0x0053,0x0065,0x0067,0x0000},//Seg
													{0x0054,0x0065,0x0072,0x0000},//Ter
													{0x0051,0x0075,0x0061,0x0000},//Qua
													{0x0051,0x0075,0x0069,0x0000},//Qui
													{0x0053,0x0065,0x0078,0x0000},//Sex
													{0x0053,0x00E1,0x0062,0x0000},//Sáb
												},
												{//Polish
													{0x004E,0x0069,0x0065,0x0064,0x007A,0x0000},//Niedz
													{0x0050,0x006F,0x006E,0x002E,0x0000},//Pon.
													{0x0057,0x0074,0x002E,0x0000},//Wt.
													{0x015A,0x0072,0x006F,0x0000},//?r.
													{0x0043,0x007A,0x0077,0x002E,0x0000},//Czw.
													{0x0050,0x0074,0x002E,0x0000},//Pt.
													{0x0053,0x006F,0x0062,0x002E,0x0000},//Sob.
												},
												{//Swedish
													{0x0053,0x006F,0x0000},//So
													{0x004D,0x006F,0x0000},//Mo
													{0x0054,0x0075,0x0000},//Tu
													{0x0057,0x0065,0x0000},//We
													{0x0054,0x0068,0x0000},//Th
													{0x0046,0x0072,0x0000},//Fr
													{0x0053,0x0061,0x0000},//Sa
												},
												{//Japanese
													{0x65E5,0x66DC,0x0000},//日曜
													{0x6708,0x66DC,0x0000},//月曜
													{0x706B,0x66DC,0x0000},//火曜
													{0x6C34,0x66DC,0x0000},//水曜
													{0x6728,0x66DC,0x0000},//木曜
													{0x91D1,0x66DC,0x0000},//金曜
													{0x571F,0x66DC,0x0000},//土曜
												},
												{//Korea
													{0xC77C,0xC694,0xC77C,0x0000},//???
													{0xC6D4,0xC694,0xC77C,0x0000},//???
													{0xD654,0xC694,0xC77C,0x0000},//???
													{0xC218,0xC694,0xC77C,0x0000},//???
													{0xBAA9,0xC694,0xC77C,0x0000},//???
													{0xAE08,0xC694,0xC77C,0x0000},//???
													{0xD1A0,0xC694,0xC77C,0x0000},//???
												},
												{//Russian
													{0x0412,0x0441,0x043A,0x0000},//Вск
													{0x041F,0x043D,0x0434,0x0000},//Пнд
													{0x0412,0x0442,0x0000},//Вт
													{0x0421,0x0440,0x0434,0x0000},//Срд
													{0x0427,0x0442,0x0000},//Чт
													{0x041F,0x0442,0x0000},//Пт
													{0x0421,0x0431,0x0000},//Сб
												},
												{//Greece
													{0x039A,0x03C5,0x03C1,0x002E,0x0000},//Κυρ.
													{0x0394,0x03B5,0x03C5,0x03C4,0x002E,0x0000},//Δευτ.
													{0x03A4,0x03C1,0x03AF,0x0000},//Τρ?
													{0x03A4,0x03B5,0x03C4,0x002E,0x0000},//Τετ.
													{0x03A0,0x03B5,0x03BC,0x002E,0x0000},//Πεμ.
													{0x03A0,0x03B1,0x03C1,0x002E,0x0000},//Παρ.
													{0x03A3,0x03B1,0x03B2,0x002E,0x0000},//Σαβ.
												},
											#else	
												{
				 									{0x5468,0x65E5,0x0000},//周日
													{0x5468,0x4E00,0x0000},//周一
													{0x5468,0x4E8C,0x0000},//周二
													{0x5468,0x4E09,0x0000},//周三
													{0x5468,0x56DB,0x0000},//周四
													{0x5468,0x4E94,0x0000},//周五
													{0x5468,0x516D,0x0000},//周六
												},
												{
													{0x0053,0x0075,0x006E,0x0000},//Sun
													{0x004D,0x006F,0x006E,0x0000},//Mon
													{0x0054,0x0075,0x0065,0x0000},//Tue
													{0x0057,0x0065,0x0064,0x0000},//Wed
													{0x0054,0x0068,0x0075,0x0000},//Thu
													{0x0046,0x0072,0x0069,0x0000},//Fri
													{0x0053,0x0061,0x0074,0x0000},//Sat
												},
											#endif
											};
#else
	uint8_t str_week[128] = {0};
#endif
	
	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);

	switch(global_settings.language)
	{
  #ifdef FW_FOR_CN	
	case LANGUAGE_CHN:
		x = IDLE_WEEK_CN_X;
		y = IDLE_WEEK_CN_Y;
		w = IDLE_WEEK_CN_W;
		h = IDLE_WEEK_CN_H;
		break;

  #else
	case LANGUAGE_JP:
	case LANGUAGE_KR:
		x = IDLE_WEEK_CN_X;
		y = IDLE_WEEK_CN_Y;
		w = IDLE_WEEK_CN_W;
		h = IDLE_WEEK_CN_H;
		break;
		
	case LANGUAGE_RU:
	case LANGUAGE_GR:
		x = IDLE_WEEK_EN_X-10;
		y = IDLE_WEEK_EN_Y;
		w = IDLE_WEEK_EN_W+10;
		h = IDLE_WEEK_EN_H;
		break;
  #endif
	default:
		x = IDLE_WEEK_EN_X;
		y = IDLE_WEEK_EN_Y;
		w = IDLE_WEEK_EN_W;
		h = IDLE_WEEK_EN_H;
		break;
	}	
	LCD_FillColor(x, y, w, h, BLACK);
	LCD_ShowUniString(x, y, str_week[global_settings.language][date_time.week]);
#else
	LCD_SetFontSize(FONT_SIZE_32);
	GetSystemWeekStrings(str_week);
	LCD_ShowString(IDLE_WEEK_EN_X, IDLE_WEEK_EN_Y, str_week);
#endif
}

void IdleShowDateTime(void)
{
	IdleShowSystemTime();
	IdleShowSystemDate();
	IdleShowSystemWeek();
}

void IdleUpdateBatSoc(void)
{
	static bool flag = true;
	uint16_t w,h;
	uint8_t strbuf[128] = {0};

	if(g_bat_soc >= 100)
		sprintf(strbuf, "%d%%", g_bat_soc);
	else if(g_bat_soc >= 10)
		sprintf(strbuf, "   %d%%", g_bat_soc);
	else
		sprintf(strbuf, "      %d%%", g_bat_soc);

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else	
	LCD_SetFontSize(FONT_SIZE_16);
#endif

