duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
			LCD_ShowImg_From_Flash(SETTINGS_MEUN_PAGE3_DOT_X, SETTINGS_MEUN_PAGE3_DOT_Y, page3_img[settings_menu.index/SETTINGS_MAIN_MENU_MAX_PER_PG]);
		}
		else
		{
			uint32_t page2_img[2] = {IMG_SET_PG2_1_ADDR,IMG_SET_PG2_2_ADDR};
			
			LCD_ShowImg_From_Flash(SETTINGS_MEUN_PAGE2_DOT_X, SETTINGS_MEUN_PAGE2_DOT_Y, page2_img[settings_menu.index/SETTINGS_MAIN_MENU_MAX_PER_PG]);
		}

	#ifdef CONFIG_TOUCH_SUPPORT
		register_touch_event_handle(TP_EVENT_MOVING_UP, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.pg_handler[0]);
		register_touch_event_handle(TP_EVENT_MOVING_DOWN, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.pg_handler[1]);
	#endif		
	}

	LCD_ReSetFontBgColor();
	LCD_ReSetFontColor();

#ifndef CONFIG_FACTORY_TEST_SUPPORT
	k_timer_start(&mainmenu_timer, K_SECONDS(5), K_NO_WAIT);
#endif
}

void SettingsShowStatus(void)
{
	uint16_t i,x,y,w,h;
	uint16_t menu_sle_str[LANGUAGE_MAX][11] = {
											#ifndef FW_FOR_CN
												{0x0045,0x006E,0x0067,0x006C,0x0069,0x0073,0x0068,0x0000},//English
												{0x0044,0x0065,0x0075,0x0074,0x0073,0x0063,0x0068,0x0000},//Deutsch
												{0x0046,0x0072,0x0061,0x006E,0x00E7,0x0061,0x0069,0x0073,0x0000},//Fran?ais
												{0x0049,0x0074,0x0061,0x006C,0x0069,0x0061,0x006E,0x006F,0x0000},//Italiano
												{0x0045,0x0073,0x0070,0x0061,0x00F1,0x006F,0x006C,0x0000},//Espa?ol
												{0x0050,0x006F,0x0072,0x0074,0x0075,0x0067,0x0075,0x00EA,0x0073,0x0000},//Português
												{0x0050,0x006F,0x006C,0x0073,0x006B,0x0069,0x0000},//Polski
												{0x0053,0x0076,0x0065,0x006E,0x0073,0x006B,0x0061,0x0000},//Svenska
												{0x65E5,0x672C,0x8A9E,0x0000},//日本語
												{0xD55C,0xAD6D,0xC778,0x0000},//???
												{0x0420,0x0443,0x0441,0x0441,0x043A,0x0438,0x0439,0x0000},//Русский
												{0x064A,0x0628,0x0631,0x0639,0x0000},//????
											#else
												{0x4E2D,0x6587,0x0000},//中文
												{0x0045,0x006E,0x0067,0x006C,0x0069,0x0073,0x0068,0x0000},//English
											#endif	
											};
	uint16_t level_str[LANGUAGE_MAX][4][11] = {
											#ifndef FW_FOR_CN
												{
													{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0031,0x0000},//Level 1
													{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0032,0x0000},//Level 2
													{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0033,0x0000},//Level 3
													{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0034,0x0000},//Level 4
												},
												{
													{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0031,0x0000},//Level 1
													{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0032,0x0000},//Level 2
													{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0033,0x0000},//Level 3
													{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0034,0x0000},//Level 4
												},
												{
													{0x004E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0031,0x0000},//Niveau 1
													{0x004E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0032,0x0000},//Niveau 2
													{0x004E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0033,0x0000},//Niveau 3
													{0x004E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0034,0x0000},//Niveau 4
												},
												{
													{0x004C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0031,0x0000},//Livello 1
													{0x004C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0032,0x0000},//Livello 2
													{0x004C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0033,0x0000},//Livello 3
													{0x004C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0034,0x0000},//Livello 4
												},
												{
													{0x004E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0031,0x0000},//Nivel 1
													{0x004E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0032,0x0000},//Nivel 2
													{0x004E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0033,0x0000},//Nivel 3
													{0x004E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0034,0x0000},//Nivel 4
												},
												{
													{0x004E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0031,0x0000},//Nível 1
													{0x004E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0032,0x0000},//Nível 2
													{0x004E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0033,0x0000},//Nível 3
													{0x004E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0034,0x0000},//Nível 4
												},
												{
													{0x0050,0x006F,0x007A,0x0069,0x006F,0x006D,0x0020,0x0031,0x0000},//Poziom 1
													{0x0050,0x006F,0x007A,0x0069,0x006F,0x006D,0x0020,0x0032,0x0000},//Poziom 2
													{0x0050,0x006F,0x007A,0x0069,0x006F,0x006D,0x0020,0x0033,0x0000},//Poziom 3
													{0x0050,0x006F,0x007A,0x0069,0x006F,0x006D,0x0020,0x0034,0x0000},//Poziom 4
												},
												{
													{0x004E,0x0069,0x0076,0x00E5,0x0020,0x0031,0x0000},//Niv? 1
													{0x004E,0x0069,0x0076,0x00E5,0x0020,0x0032,0x0000},//Niv? 2
													{0x004E,0x0069,0x0076,0x00E5,0x0020,0x0033,0x0000},//Niv? 3
													{0x004E,0x0069,0x0076,0x00E5,0x0020,0x0034,0x0000},//Niv? 4
												},
												{
													{0x30EC,0x30D9,0x30EB,0x0031,0x0000},//レベル1
													{0x30EC,0x30D9,0x30EB,0x0032,0x0000},//レベル2
													{0x30EC,0x30D9,0x30EB,0x0033,0x0000},//レベル3
													{0x30EC,0x30D9,0x30EB,0x0034,0x0000},//レベル4
												},
												{
													{0xB808,0xBCA8,0x0020,0x0031,0x0000},//?? 1
													{0xB808,0xBCA8,0x0020,0x0032,0x0000},//?? 2
													{0xB808,0xBCA8,0x0020,0x0033,0x0000},//?? 3
													{0xB808,0xBCA8,0x0020,0x0034,0x0000},//?? 4
												},
												{
													{0x0423,0x0440,0x002E,0x0020,0x0031,0x0000},//Ур. 1
													{0x0423,0x0440,0x002E,0x0020,0x0032,0x0000},//Ур. 2
													{0x0423,0x0440,0x002E,0x0020,0x0033,0x0000},//Ур. 3
													{0x0423,0x0440,0x002E,0x0020,0x0034,0x0000},//Ур. 4
												},
												{
													{0x0395,0x03C0,0x03AF,0x03C0,0x03B5,0x03B4,0x03BF,0x0020,0x0031,0x0000},//Επ?πεδο 1
													{0x0395,0x03C0,0x03AF,0x03C0,0x03B5,0x03B4,0x03BF,0x0020,0x0032,0x0000},//Επ?πεδο 2
													{0x0395,0x03C0,0x03AF,0x03C0,0x03B5,0x03B4,0x03BF,0x0020,0x0033,0x0000},//Επ?πεδο 3
													{0x0395,0x03C0,0x03AF,0x03C0,0x03B5,0x03B4,0x03BF,0x0020,0x0034,0x0000},//Επ?πεδο 4
												},
											#else	
												{
													{0x7B49,0x7EA7,0x0031,0x0000},//等级1
													{0x7B49,0x7EA7,0x0032,0x0000},//等级2
													{0x7B49,0x7EA7,0x0033,0x0000},//等级3
													{0x7B49,0x7EA7,0x0034,0x0000},//等级4
												},
												{
													{0x0649,0x0648,0x062A,0x0633,0x0645,0x0644,0x0627,0x0020,0x0031,0x0000},//??????? 1
													{0x0649,0x0648,0x062A,0x0633,0x0645,0x0644,0x0627,0x0020,0x0032,0x0000},//??????? 2
													{0x0649,0x0648,0x062A,0x0633,0x0645,0x0644,0x0627,0x0020,0x0033,0x0000},//??????? 3
													{0x0649,0x0648,0x062A,0x0633,0x0645,0x0644,0x0627,0x0020,0x0034,0x0000},//??????? 4
												},
											#endif
											};
	uint32_t img_addr[2] = {IMG_SET_TEMP_UNIT_C_ICON_ADDR, IMG_SET_TEMP_UNIT_F_ICON_ADDR};
	uint16_t bg_clor = 0x2124;
	uint16_t green_clor = 0x07e0;
	
	LCD_Clear(BLACK);

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else
	LCD_SetFontSize(FONT_SIZE_16);
#endif
	LCD_SetFontBgColor(bg_clor);

