duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
		LCD_MeasureUniString(tmpbuf1, &w, &h);
		LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y, tmpbuf1);
		LCD_MeasureUniString(tmpbuf2, &w, &h);
		LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y+h+2, tmpbuf2);
		break;
	}
#endif

	SetRightKeyUpHandler(fota_excu);
	SetLeftKeyUpHandler(fota_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_YES_X-30, FOTA_YES_X+FOTA_YES_W+30, FOTA_YES_Y-30, FOTA_YES_Y+FOTA_YES_H+30, fota_excu);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NO_X-30, FOTA_NO_X+FOTA_NO_W+30, FOTA_NO_Y-30, FOTA_NO_Y+FOTA_NO_H+30, fota_exit);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_exit);	
#endif
}

void FOTAUpdateStatus(void)
{
	uint16_t pro_len;
	uint16_t x,y,w,h;
	uint8_t pro_buf[16] = {0};
	uint16_t tmpbuf[128] = {0};
	static bool flag = false;
	static uint16_t pro_str_x,pro_str_y;

#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif	
	switch(get_fota_status())
	{
	case FOTA_STATUS_PREPARE:
		flag = false;
		break;
		
	case FOTA_STATUS_LINKING:
		{
			uint16_t str_notify[LANGUAGE_MAX][28] = {
													#ifndef FW_FOR_CN
														{0x004C,0x0069,0x006E,0x006B,0x0069,0x006E,0x0067,0x0020,0x0074,0x006F,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x002E,0x002E,0x002E,0x0000},//Linking to server...
														{0x0056,0x0065,0x0072,0x006C,0x0069,0x006E,0x006B,0x0075,0x006E,0x0067,0x0020,0x007A,0x0075,0x006D,0x0020,0x0053,0x0065,0x0072,0x0076,0x0065,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000},//Verlinkung zum Server ...
														{0x004C,0x0069,0x0065,0x006E,0x0020,0x0076,0x0065,0x0072,0x0073,0x0020,0x006C,0x0065,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0075,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000},//Lien vers le serveur ...
														{0x0043,0x006F,0x006C,0x006C,0x0065,0x0067,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0061,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000},//Collegamento al server ...
														{0x0045,0x006E,0x006C,0x0061,0x0063,0x0065,0x0020,0x0061,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,0x0069,0x0064,0x006F,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000},//Enlace al servidor ...
														{0x0056,0x0069,0x006E,0x0063,0x0075,0x006C,0x0061,0x006E,0x0064,0x006F,0x0020,0x0061,0x006F,0x0020,0x0073,0x0065,0x0072,0x0076,0x0069,0x0064,0x006F,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000},//Vinculando ao servidor ...
														{0x0141,0x0105,0x0063,0x007A,0x0119,0x0020,0x007A,0x0020,0x0073,0x0065,0x0072,0x0077,0x0065,0x0072,0x0065,0x006D,0x002E,0x002E,0x002E,0x0000},//??cz? z serwerem...
														{0x004C,0x00E4,0x006E,0x006B,0x0061,0x0072,0x0020,0x0074,0x0069,0x006C,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x002E,0x002E,0x002E,0x0000},//L?nkar till server...
														{0x30B5,0x30FC,0x30D0,0x30FC,0x306B,0x63A5,0x7D9A,0x4E2D,0x002E,0x002E,0x002E,0x0000},//サーバーに接続中...
														{0xC5F0,0xACB0,0x0020,0xC11C,0xBC84,0x2026,0x0000},//?? ??…
														{0x041F,0x043E,0x0434,0x043A,0x043B,0x044E,0x0447,0x0435,0x043D,0x0438,0x0435,0x002E,0x002E,0x002E,0x0000},//Подключение...
														{0x03A3,0x03CD,0x03BD,0x03B4,0x03B5,0x03C3,0x03B7,0x0020,0x03BC,0x03B5,0x0020,0x03B4,0x03B9,0x03B1,0x03BA,0x03BF,0x03BC,0x03B9,0x03C3,0x03C4,0x03AE,0x002E,0x002E,0x002E,0x0000},//Σ?νδεση με διακομιστ?...
													#else
														{0x8FDE,0x63A5,0x670D,0x52A1,0x5668,0x002E,0x002E,0x002E,0x0000},//连接服务器...
														{0x004C,0x0069,0x006E,0x006B,0x0069,0x006E,0x0067,0x0020,0x0074,0x006F,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x002E,0x002E,0x002E,0x0000},//Linking to server...
													#endif
													};

			LCD_Fill(0, FOTA_YES_Y, LCD_WIDTH, FOTA_YES_H, BLACK);
			LCD_Fill(0, FOTA_START_STR_Y, LCD_WIDTH, FOTA_START_STR_H, BLACK);

		#ifdef FONTMAKER_UNICODE_FONT
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, tmpbuf);
		#endif

			ClearAllKeyHandler();
		}
		break;
		
	case FOTA_STATUS_DOWNLOADING:
		if(!flag)
		{
			uint16_t str_notify[LANGUAGE_MAX][32] = {
													#ifndef FW_FOR_CN
														{0x0044,0x0061,0x0074,0x0061,0x0020,0x0064,0x006F,0x0077,0x006E,0x006C,0x006F,0x0061,0x0064,0x0069,0x006E,0x0067,0x002E,0x002E,0x002E,0x0000},//Data downloading...
														{0x0044,0x0061,0x0074,0x0065,0x006E,0x0020,0x0068,0x0065,0x0072,0x0075,0x006E,0x0074,0x0065,0x0072,0x006C,0x0061,0x0064,0x0065,0x006E,0x0020,0x002E,0x002E,0x002E,0x0000},//Daten herunterladen ...
														{0x0054,0x00E9,0x006C,0x00E9,0x0063,0x0068,0x0061,0x0072,0x0067,0x0065,0x006D,0x0065,0x006E,0x0074,0x0020,0x0064,0x0065,0x0073,0x0020,0x0064,0x006F,0x006E,0x006E,0x00E9,0x0065,0x0073,0x0020,0x002E,0x002E,0x002E,0x0000},//Téléchargement des données ...
														{0x0053,0x0063,0x0061,0x0072,0x0069,0x0063,0x0061,0x0072,0x0065,0x0020,0x0069,0x0020,0x0064,0x0061,0x0074,0x0069,0x0020,0x002E,0x002E,0x002E,0x0000},//Scaricare i dati ...
														{0x0044,0x0065,0x0073,0x0063,0x0061,0x0072,0x0067,0x0061,0x0020,0x0064,0x0065,0x0020,0x0064,0x0061,0x0074,0x006F,0x0073,0x0020,0x002E,0x002E,0x002E,0x0000},//Descarga de datos ...
														{0x0042,0x0061,0x0069,0x0078,0x0061,0x006E,0x0064,0x006F,0x0020,0x0064,0x0061,0x0064,0x006F,0x0073,0x0020,0x002E,0x002E,0x002E,0x0000},//Baixando dados ...
														{0x0050,0x006F,0x0062,0x0069,0x0065,0x0072,0x0061,0x006E,0x0069,0x0065,0x0020,0x0064,0x0061,0x006E,0x0079,0x0063,0x0068,0x002E,0x002E,0x002E,0x0000},//Pobieranie danych...
														{0x0044,0x0061,0x0074,0x0061,0x0020,0x006C,0x0061,0x0064,0x0064,0x0061,0x0073,0x0020,0x006E,0x0065,0x0064,0x002E,0x002E,0x002E,0x0000},//Data laddas ned...
														{0x30C7,0x30FC,0x30BF,0x3092,0x30C0,0x30A6,0x30F3,0x30ED,0x30FC,0x30C9,0x4E2D,0x2026,0x0000},//データをダウンロード中…
														{0xB370,0xC774,0xD130,0x0020,0xB2E4,0xC6B4,0xB85C,0xB4DC,0x2026,0x0000},//??? ????…
														{0x0417,0x0430,0x0433,0x0440,0x0443,0x0437,0x043A,0x0430,0x0020,0x0434,0x0430,0x043D,0x043D,0x044B,0x0445,0x002E,0x002E,0x002E,0x0000},//Загрузка данных...
														{0x039B,0x03AE,0x03C8,0x03B7,0x0020,0x03B4,0x03B5,0x03B4,0x03BF,0x03BC,0x03AD,0x03BD,0x03C9,0x03BD,0x002E,0x002E,0x002E,0x0000},//Λ?ψη δεδομ?νων...
													#else
														{0x6570,0x636E,0x4E0B,0x8F7D,0x4E2D,0x002E,0x002E,0x002E,0x0000},//数据下载中…
														{0x0044,0x0061,0x0074,0x0061,0x0020,0x0064,0x006F,0x0077,0x006E,0x006C,0x006F,0x0061,0x0064,0x0069,0x006E,0x0067,0x002E,0x002E,0x002E,0x0000},//Data downloading...
													#endif
													};
			
