duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
			flag = true;
			
			LCD_Fill(0, FOTA_START_STR_Y, LCD_WIDTH, FOTA_START_STR_H, BLACK);

			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, tmpbuf);
					
			LCD_DrawRectangle(FOTA_PROGRESS_X, FOTA_PROGRESS_Y, FOTA_PROGRESS_W, FOTA_PROGRESS_H);
			LCD_Fill(FOTA_PROGRESS_X+1, FOTA_PROGRESS_Y+1, FOTA_PROGRESS_W-1, FOTA_PROGRESS_H-1, BLACK);
			
			sprintf(pro_buf, "%d%%", g_fota_progress);
		#ifdef FONTMAKER_UNICODE_FONT
			LCD_SetFontSize(FONT_SIZE_20);
		#else	
			LCD_SetFontSize(FONT_SIZE_16);
		#endif
			memset(tmpbuf, 0x0000, sizeof(tmpbuf));
			mmi_asc_to_ucs2(tmpbuf, pro_buf);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			pro_str_x = FOTA_PRO_NUM_X+(FOTA_PRO_NUM_W-w)/2;
			pro_str_y = FOTA_PRO_NUM_Y+(FOTA_PRO_NUM_H-h)/2;
			LCD_ShowUniString(pro_str_x,pro_str_y, tmpbuf);
		}
		else
		{
			pro_len = (g_fota_progress*FOTA_PROGRESS_W)/100;
			LCD_Fill(FOTA_PROGRESS_X+1, FOTA_PROGRESS_Y+1, pro_len, FOTA_PROGRESS_H-1, WHITE);
			
			sprintf(pro_buf, "%d%%", g_fota_progress);
			memset(tmpbuf, 0x0000, sizeof(tmpbuf));
			mmi_asc_to_ucs2(tmpbuf, pro_buf);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			LCD_ShowUniString(pro_str_x, pro_str_y, tmpbuf);
		}		

		ClearAllKeyHandler();
		break;
		
	case FOTA_STATUS_FINISHED:
		{
			static bool is_finished = false;
			uint16_t str_notify[LANGUAGE_MAX][26] = {
													#ifndef FW_FOR_CN
														{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0063,0x006F,0x006D,0x0070,0x006C,0x0065,0x0074,0x0065,0x0064,0x0000},//Upgrade completed
														{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0065,0x0072,0x0066,0x006F,0x006C,0x0067,0x0072,0x0065,0x0069,0x0063,0x0068,0x0000},//Upgrade erfolgreich
														{0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0074,0x0065,0x0072,0x006D,0x0069,0x006E,0x00E9,0x0065,0x0000},//Mise à niveau terminée
														{0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0072,0x0069,0x0075,0x0073,0x0063,0x0069,0x0074,0x006F,0x0000},//Aggiornamento riuscito
														{0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0065,0x0078,0x0069,0x0074,0x006F,0x0073,0x0061,0x0000},//Actualización exitosa
														{0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0072,0x0020,0x0062,0x0065,0x006D,0x0020,0x002D,0x0073,0x0075,0x0063,0x0065,0x0064,0x0069,0x0064,0x006F,0x0000},//Atualizar bem -sucedido
														{0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x0075,0x006B,0x006F,0x0144,0x0063,0x007A,0x006F,0x006E,0x0061,0x0000},//Aktualizacja ukończona
														{0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0065,0x006E,0x0020,0x0073,0x006C,0x0075,0x0074,0x0066,0x00F6,0x0072,0x0064,0x0000},//Uppgraderingen slutf?rd
														{0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x6210,0x529F,0x0000},//アップグレード成功
														{0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0020,0xC131,0xACF5,0x0000},//????? ??
														{0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x0437,0x0430,0x0432,0x0435,0x0440,0x0448,0x0435,0x043D,0x043E,0x0000},//Обновление завершено
														{0x0397,0x0020,0x03B1,0x03BD,0x03B1,0x03B2,0x03AC,0x03B8,0x03BC,0x03B9,0x03C3,0x03B7,0x0020,0x03BF,0x03BB,0x03BF,0x03BA,0x03BB,0x03B7,0x03C1,0x03CE,0x03B8,0x03B7,0x03BA,0x03B5,0x0000},//Η αναβ?θμιση ολοκληρ?θηκε
													#else
														{0x5347,0x7EA7,0x6210,0x529F,0x0000},//升级成功
														{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0063,0x006F,0x006D,0x0070,0x006C,0x0065,0x0074,0x0065,0x0064,0x0000},//Upgrade completed
													#endif
													};
			
			flag = false;

			if(!is_finished)
			{
				is_finished = true;
				
				LCD_Clear(BLACK);
				LCD_ShowImg_From_Flash(FOTA_FINISH_ICON_X, FOTA_FINISH_ICON_Y, IMG_OTA_FINISH_ICON_ADDR);
				
			#ifdef FONTMAKER_UNICODE_FONT
				mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
				LCD_MeasureUniString(tmpbuf, &w, &h);
				LCD_ShowUniString(FOTA_FINISH_STR_X+(FOTA_FINISH_STR_W-w)/2, FOTA_FINISH_STR_Y+(FOTA_FINISH_STR_H-h)/2, tmpbuf);
			#endif
			
				SetLeftKeyUpHandler(fota_reboot_confirm);
				SetRightKeyUpHandler(fota_reboot_confirm);
			#ifdef CONFIG_TOUCH_SUPPORT
				register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_reboot_confirm);
			#endif
			}
		}
		break;
		
	case FOTA_STATUS_ERROR:
		{
			uint16_t str_notify[LANGUAGE_MAX][30] = {
													#ifndef FW_FOR_CN
														{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0066,0x0061,0x0069,0x006C,0x0065,0x0064,0x0000},//Upgrade failed
														{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0066,0x0065,0x0068,0x006C,0x0067,0x0065,0x0073,0x0063,0x0068,0x006C,0x0061,0x0067,0x0065,0x006E,0x0000},//Upgrade fehlgeschlagen
														{0x004C,0x0061,0x0020,0x006D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0061,0x0020,0x00E9,0x0063,0x0068,0x006F,0x0075,0x00E9,0x0000},//La mise à niveau a échoué
														{0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0066,0x0061,0x006C,0x006C,0x0069,0x0074,0x006F,0x0000},//Aggiornamento fallito
														{0x0045,0x0072,0x0072,0x006F,0x0072,0x0020,0x0064,0x0065,0x0020,0x0061,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0000},//Error de actualización
														{0x0046,0x0061,0x006C,0x0068,0x0061,0x0020,0x006E,0x0061,0x0020,0x0061,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x00E7,0x00E3,0x006F,0x0000},//Falha na atualiza??o
														{0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x002E,0x0020,0x006E,0x0069,0x0065,0x0075,0x0064,0x0061,0x006E,0x0061,0x0000},//Aktual. nieudana
														{0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0065,0x006E,0x0020,0x006D,0x0069,0x0073,0x0073,0x006C,0x0079,0x0063,0x006B,0x0061,0x0064,0x0065,0x0073,0x0000},//Uppgraderingen misslyckades
														{0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x5931,0x6557,0x0000},//アップグレード失敗
														{0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0020,0xC2E4,0xD328,0x0000},//????? ??
														{0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x043D,0x0435,0x0020,0x0443,0x0434,0x0430,0x043B,0x043E,0x0441,0x044C,0x0000},//Обновление не удалось
														{0x0397,0x0020,0x03B1,0x03BD,0x03B1,0x03B2,0x03AC,0x03B8,0x03BC,0x03B9,0x03C3,0x03B7,0x0020,0x03B1,0x03C0,0x03AD,0x03C4,0x03C5,0x03C7,0x03B5,0x0000},//Η αναβ?θμιση απ?τυχε
													#else
														{0x5347,0x7EA7,0x5931,0x8D25,0x0000},//升级失败
														{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0066,0x0061,0x0069,0x006C,0x0065,0x0064,0x0000},//Upgrade failed
													#endif
													};
			
